hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/7 USB充电检测仪（不含关断功能 OK ）/IDEsupport/EWARM/arm/config/debugger/WHXY/CW32L010.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Wuhan Xinyuan Semiconductor Co.Ltd</vendor>
  <vendorID>WHXY</vendorID>
  <name>CW32L010</name>
  <description>CW32L010x8xx</description>
  <series>ARMCM0P</series>
  <version>1.2</version>
  <cpu>
    <name>CM0+</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>2</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x0</resetValue>
  <resetMask>0x0</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>desc ADC</description>
      <baseAddress>0x40000000</baseAddress>
      <interrupt>
        <name>ADC</name>
        <description>ADC Interrupt</description>
        <value>12</value>
      </interrupt>
      <headerStructName>ADC</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>desc CR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENS</name>
              <description>desc ENS</description>
              <msb>8</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK</name>
              <description>desc CLKSRC</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CONT</name>
              <description>desc CONT</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEN</name>
              <description>desc TSEN</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BGREN</name>
              <description>desc BGREN</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>START</name>
          <description>desc START</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>START</name>
              <description>desc START</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SQRCFR</name>
          <description>desc SQRCFR</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SQRCH7</name>
              <description>desc SQRCH7</description>
              <msb>31</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH6</name>
              <description>desc SQRCH6</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH5</name>
              <description>desc SQRCH5</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH4</name>
              <description>desc SQRCH4</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH3</name>
              <description>desc SQRCH3</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH2</name>
              <description>desc SQRCH2</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH1</name>
              <description>desc SQRCH1</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH0</name>
              <description>desc SQRCH0</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWDTR</name>
          <description>desc AWDTR</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VTH</name>
              <description>desc VTH</description>
              <msb>27</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>VTL</name>
              <description>desc VTL</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWDCR</name>
          <description>desc AWDCR</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IN15</name>
              <description>desc IN15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN14</name>
              <description>desc IN14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN13</name>
              <description>desc IN13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN12</name>
              <description>desc IN12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN11</name>
              <description>desc IN11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN10</name>
              <description>desc IN10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN9</name>
              <description>desc IN9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN8</name>
              <description>desc IN8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN7</name>
              <description>desc IN7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN6</name>
              <description>desc IN6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN5</name>
              <description>desc IN5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN4</name>
              <description>desc IN4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN3</name>
              <description>desc IN3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN2</name>
              <description>desc IN2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN1</name>
              <description>desc IN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IN0</name>
              <description>desc IN0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLE</name>
          <description>desc SAMPLE</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SQRCH7</name>
              <description>desc SQRCH7</description>
              <msb>31</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH6</name>
              <description>desc SQRCH6</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH5</name>
              <description>desc SQRCH5</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH4</name>
              <description>desc SQRCH4</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH3</name>
              <description>desc SQRCH3</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH2</name>
              <description>desc SQRCH2</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH1</name>
              <description>desc SQRCH1</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQRCH0</name>
              <description>desc SQRCH0</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGGER</name>
          <description>desc TRIGGER</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UART2</name>
              <description>desc UART2</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1</name>
              <description>desc UART1</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI1</name>
              <description>desc SPI1</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIM3TRGO</name>
              <description>desc BTIM3TRGO</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIM2TRGO</name>
              <description>desc BTIM2TRGO</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIM1TRGO</name>
              <description>desc BTIM1TRGO</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1CC4</name>
              <description>desc GTIM1CC4</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1CC3</name>
              <description>desc GTIM1CC3</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1CC2</name>
              <description>desc GTIM1CC2</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1CC1</name>
              <description>desc GTIM1CC1</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1TRGO</name>
              <description>desc GTIM1TRGO</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIMCC6</name>
              <description>desc ATIMCC6</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIMCC5</name>
              <description>desc ATIMCC5</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIMCC4</name>
              <description>desc ATIMCC4</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIMCC3</name>
              <description>desc ATIMCC3</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIMCC2</name>
              <description>desc ATIMCC2</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIMCC1</name>
              <description>desc ATIMCC1</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIMTRGO2</name>
              <description>desc ATIMTRGO2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIMTRGO</name>
              <description>desc ATIMTRGO</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>desc IER</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AWDH</name>
              <description>desc AWDH</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AWDL</name>
              <description>desc AWDL</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EOS</name>
              <description>desc EOS</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC</name>
              <description>desc EOC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>desc ISR</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>AWDH</name>
              <description>desc AWDH</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>AWDL</name>
              <description>desc AWDL</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>EOS</name>
              <description>desc EOS</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>EOC</name>
              <description>desc EOC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>desc ICR</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AWDH</name>
              <description>desc AWDH</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AWDL</name>
              <description>desc AWDL</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EOS</name>
              <description>desc EOS</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC</name>
              <description>desc EOC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT0</name>
          <description>desc RESULT0</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>desc RESULT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT1</name>
          <description>desc RESULT1</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>desc RESULT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT2</name>
          <description>desc RESULT2</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>desc RESULT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT3</name>
          <description>desc RESULT3</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>desc RESULT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT4</name>
          <description>desc RESULT4</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>desc RESULT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT5</name>
          <description>desc RESULT5</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>desc RESULT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT6</name>
          <description>desc RESULT6</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>desc RESULT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT7</name>
          <description>desc RESULT7</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>desc RESULT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
