hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/7 USB充电检测仪（不含关断功能 OK ）/IDEsupport/EWARM/arm/config/debugger/WHXY/CW32L010.svd
        <register>
          <name>CCR6</name>
          <description>capture compare register6</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GC6C6</name>
              <description>desc GC6C6</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GC6C5</name>
              <description>desc GC6C5</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GC6C4</name>
              <description>desc GC6C4</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GC6C3</name>
              <description>desc GC6C3</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GC6C2</name>
              <description>desc GC6C2</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GC6C1</name>
              <description>desc GC6C1</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CCR6</name>
              <description>desc CCR6</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BDTR</name>
          <description>break and dead-time register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BK2P</name>
              <description>desc BK2P</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BK2E</name>
              <description>desc BK2E</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BK2F</name>
              <description>desc BK2F</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BKF</name>
              <description>desc BKF</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MOE</name>
              <description>desc MOE</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AOE</name>
              <description>desc AOE</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BKP</name>
              <description>desc BKP</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BKE</name>
              <description>desc BKE</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSR</name>
              <description>desc OSSR</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSI</name>
              <description>desc OSSI</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>desc LOCK</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DTG</name>
              <description>desc DTG</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTR2</name>
          <description>dead-time register2</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DTPE</name>
              <description>desc DTPE</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DTAE</name>
              <description>desc DTAE</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DTGF</name>
              <description>desc DTGF</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECR</name>
          <description>Encoder control Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IPOS</name>
              <description>desc IPOS</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FIDX</name>
              <description>desc FIDX</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IDIR</name>
              <description>desc IDIR</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>desc IE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TISEL1</name>
          <description>Timer Input Select Register1</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TI4SEL</name>
              <description>desc TI4SEL</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TI3SEL</name>
              <description>desc TI3SEL</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TI2SEL</name>
              <description>desc TI2SEL</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TI1SEL</name>
              <description>desc TI1SEL</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TISEL2</name>
          <description>Timer Input Select Register2</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TI6SEL</name>
              <description>desc TI6SEL</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TI5SEL</name>
              <description>desc TI5SEL</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF1</name>
          <description>Alternate function Register1</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ETRSEL</name>
              <description>desc ETRSEL</description>
              <msb>17</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BKVC2P</name>
              <description>desc BKVC2P</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BKVC1P</name>
              <description>desc BKVC1P</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BKINP</name>
              <description>desc BKINP</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BKVC2E</name>
              <description>desc BKVC2E</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BKVC1E</name>
              <description>desc BKVC1E</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BKINE</name>
              <description>desc BKINE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF2</name>
          <description>Alternate function Register2</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCRSEL</name>
              <description>desc OCRSEL</description>
              <msb>18</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BK2VC2P</name>
              <description>desc BK2VC2P</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BK2VC1P</name>
              <description>desc BK2VC1P</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BK2INP</name>
              <description>desc BK2INP</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BK2VC2E</name>
              <description>desc BK2VC2E</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BK2VC1E</name>
              <description>desc BK2VC1E</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BK2INE</name>
              <description>desc BK2INE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt clean register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TERRF</name>
              <description>desc TERRF</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IERRF</name>
              <description>desc IERRF</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRF</name>
              <description>desc DIRF</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IDXF</name>
              <description>desc IDXF</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC6OF</name>
              <description>desc CC6OF</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC5OF</name>
              <description>desc CC5OF</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC6IF</name>
              <description>desc CC6IF</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC5IF</name>
              <description>desc CC5IF</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SBIF</name>
              <description>desc SBIF</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC4OF</name>
              <description>desc CC4OF</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC3OF</name>
              <description>desc CC3OF</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2OF</name>
              <description>desc CC2OF</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1OF</name>
              <description>desc CC1OF</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>B2IF</name>
              <description>desc B2IF</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BIF</name>
              <description>desc BIF</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIF</name>
              <description>desc TIF</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMIF</name>
              <description>desc COMIF</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC4IF</name>
              <description>desc CC4IF</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC3IF</name>
              <description>desc CC3IF</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2IF</name>
              <description>desc CC2IF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1IF</name>
              <description>desc CC1IF</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UIF</name>
              <description>desc UIF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
