hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/7 USB充电检测仪（不含关断功能 OK ）/IDEsupport/EWARM/arm/config/debugger/WHXY/CW32L010.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GTIM1</name>
      <description>General Timer 1</description>
      <baseAddress>0x40001800</baseAddress>
      <interrupt>
        <name>GTIM1</name>
        <description>General Timer1 Interrupt</description>
        <value>16</value>
      </interrupt>
      <groupName>GTIM</groupName>
      <headerStructName>GTIM</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x74</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <description>Control register1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UIFREMAP</name>
              <description>desc UIFREMAP</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CKD</name>
              <description>desc CKD</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ARPE</name>
              <description>desc ARPE</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CMS</name>
              <description>desc CMS</description>
              <msb>6</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIR</name>
              <description>desc DIR</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OPM</name>
              <description>desc OPM</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>URS</name>
              <description>desc URS</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UDIS</name>
              <description>desc UDIS</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CEN</name>
              <description>desc CEN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Control register2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MMSH</name>
              <description>desc MMSH</description>
              <msb>26</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TI1S</name>
              <description>desc TI1S</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MMS</name>
              <description>desc MMS</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCR</name>
          <description>Slave Mode control register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMSPS</name>
              <description>desc SMSPS</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMSPE</name>
              <description>desc SMSPE</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TSH</name>
              <description>desc TSH</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMSH</name>
              <description>desc SMSH</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ETP</name>
              <description>desc ETP</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ECE</name>
              <description>desc ECE</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ETPS</name>
              <description>desc ETPS</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ETF</name>
              <description>desc ETF</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MSM</name>
              <description>desc MSM</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TS</name>
              <description>desc TS</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OCCS</name>
              <description>desc OCCS</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMS</name>
              <description>desc SMS</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt control register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TERRIE</name>
              <description>desc TERRIE</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IERRIE</name>
              <description>desc IERRIE</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRIE</name>
              <description>desc DIRIE</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IDXIE</name>
              <description>desc IDXIE</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE</name>
              <description>desc TIE</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC4IE</name>
              <description>desc CC4IE</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC3IE</name>
              <description>desc CC3IE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2IE</name>
              <description>desc CC2IE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1IE</name>
              <description>desc CC1IE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UIE</name>
              <description>desc UIE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TERRF</name>
              <description>desc TERRF</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>IERRF</name>
              <description>desc IERRF</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIRF</name>
              <description>desc DIRF</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>IDXF</name>
              <description>desc IDXF</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC4OF</name>
              <description>desc CC4OF</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC3OF</name>
              <description>desc CC3OF</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC2OF</name>
              <description>desc CC2OF</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC1OF</name>
              <description>desc CC1OF</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIF</name>
              <description>desc TIF</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC4IF</name>
              <description>desc CC4IF</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC3IF</name>
              <description>desc CC3IF</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC2IF</name>
              <description>desc CC2IF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC1IF</name>
              <description>desc CC1IF</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>UIF</name>
              <description>desc UIF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt flag clear register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TERRF</name>
              <description>desc TERRF</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IERRF</name>
              <description>desc IERRF</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRF</name>
              <description>desc DIRF</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IDXF</name>
              <description>desc IDXF</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC4OF</name>
              <description>desc CC4OF</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC3OF</name>
              <description>desc CC3OF</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2OF</name>
              <description>desc CC2OF</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1OF</name>
              <description>desc CC1OF</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIF</name>
              <description>desc TIF</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC4IF</name>
              <description>desc CC4IF</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC3IF</name>
              <description>desc CC3IF</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2IF</name>
              <description>desc CC2IF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1IF</name>
              <description>desc CC1IF</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UIF</name>
              <description>desc UIF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <description>Event Generate register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TG</name>
              <description>desc TG</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC4G</name>
              <description>desc CC4G</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC3G</name>
              <description>desc CC3G</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2G</name>
              <description>desc CC2G</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1G</name>
              <description>desc CC1G</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UG</name>
              <description>desc UG</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1CAP</name>
          <description>Capture control Register1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IC2F</name>
              <description>desc IC2F</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC2PSC</name>
              <description>desc IC2PSC</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2S</name>
              <description>desc CC2S</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC1F</name>
              <description>desc IC1F</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC1PSC</name>
              <description>desc IC1PSC</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1S</name>
              <description>desc CC1S</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1CMP</name>
          <description>Compare control Register1</description>
          <alternateRegister>CCMR1CAP</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OC2MH</name>
              <description>desc OC2MH</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC1MH</name>
              <description>desc OC1MH</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC2CE</name>
              <description>desc OC2CE</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC2M</name>
              <description>desc OC2M</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC2PE</name>
              <description>desc OC2PE</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC2FE</name>
              <description>desc OC2FE</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2S</name>
              <description>desc CC2S</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC1CE</name>
              <description>desc OC1CE</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC1M</name>
              <description>desc OC1M</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC1PE</name>
              <description>desc OC1PE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC1FE</name>
              <description>desc OC1FE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1S</name>
              <description>desc CC1S</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR2CAP</name>
          <description>Capture control Register2</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IC4F</name>
              <description>desc IC4F</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC4PSC</name>
              <description>desc IC4PSC</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC4S</name>
              <description>desc CC4S</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC3F</name>
              <description>desc IC3F</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC3PSC</name>
              <description>desc IC3PSC</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC3S</name>
              <description>desc CC3S</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
