hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/7 USB充电检测仪（不含关断功能 OK ）/IDEsupport/EWARM/arm/config/debugger/WHXY/CW32L010.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>desc RTC</description>
      <baseAddress>0x40004400</baseAddress>
      <interrupt>
        <name>RTC</name>
        <description>Real Time Clock Interrupt</description>
        <value>2</value>
      </interrupt>
      <headerStructName>RTC</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x5C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KEY</name>
          <description>desc KEY</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR0</name>
          <description>desc CR0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>START</name>
              <description>desc START</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC1HZ</name>
              <description>desc RTC1HZ</description>
              <msb>6</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>H24</name>
              <description>desc H24</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERVAL</name>
              <description>desc INTERVAL</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>desc CR1</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>desc SOURCE</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT</name>
              <description>desc WAIT</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>WINDOW</name>
              <description>desc WINDOW</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ACCESS</name>
              <description>desc ACCESS</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>desc CR2</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ALARMBEN</name>
              <description>desc ALARMBEN</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ALARMAEN</name>
              <description>desc ALARMAEN</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AWTEN</name>
              <description>desc AWTEN</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMPEN</name>
              <description>desc TAMPEN</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOUT</name>
              <description>desc RTCOUT</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMPEDGE</name>
              <description>desc TAMPEDGE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AWTSRC</name>
              <description>desc AWTSRC</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AWTPRS</name>
              <description>desc AWTPRS</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <description>desc PSC</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSC1</name>
              <description>desc PSC1</description>
              <msb>27</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PSC2</name>
              <description>desc PSC2</description>
              <msb>19</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>desc DATE</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WEEK</name>
              <description>desc WEEK</description>
              <msb>26</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>YEAR</name>
              <description>desc YEAR</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MONTH</name>
              <description>desc MONTH</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DAY</name>
              <description>desc DAY</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIME</name>
          <description>desc TIME</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HOUR</name>
              <description>desc HOUR</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MINUTE</name>
              <description>desc MINUTE</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SECOND</name>
              <description>desc SECOND</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCNT</name>
          <description>desc SSCNT</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SSCNT1</name>
              <description>desc SSCNT1</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSCNT0</name>
              <description>desc SSCNT0</description>
              <msb>19</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARMA</name>
          <description>desc ALARMA</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WEEKMASK</name>
              <description>desc WEEKMASK</description>
              <msb>30</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUREN</name>
              <description>desc HOUREN</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUR</name>
              <description>desc HOUR</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MINUTEEN</name>
              <description>desc MINUTEEN</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MINUTE</name>
              <description>desc MINUTE</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SECONDEN</name>
              <description>desc SECONDEN</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SECOND</name>
              <description>desc SECOND</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARMB</name>
          <description>desc ALARMB</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WEEKMASK</name>
              <description>desc WEEKMASK</description>
              <msb>30</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUREN</name>
              <description>desc HOUREN</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUR</name>
              <description>desc HOUR</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MINUTEEN</name>
              <description>desc MINUTEEN</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MINUTE</name>
              <description>desc MINUTE</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SECONDEN</name>
              <description>desc SECONDEN</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SECOND</name>
              <description>desc SECOND</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMPDATE</name>
          <description>desc TAMPDATE</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WEEK</name>
              <description>desc WEEK</description>
              <msb>15</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>MONTH</name>
              <description>desc MONTH</description>
              <msb>12</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>DAY</name>
              <description>desc DAY</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMPTIME</name>
          <description>desc TAMPTIME</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>HOUR</name>
              <description>desc HOUR</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>MINUTE</name>
              <description>desc MINUTE</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SECOND</name>
              <description>desc SECOND</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>desc IER</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INTERVAL</name>
              <description>desc INTERVAL</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMPOV</name>
              <description>desc TAMPOV</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMP</name>
              <description>desc TAMP</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AWTIMER</name>
              <description>desc AWTIMER</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ALARMB</name>
              <description>desc ALARMB</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ALARMA</name>
              <description>desc ALARMA</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>desc ISR</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>INTERVAL</name>
              <description>desc INTERVAL</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TAMPOV</name>
              <description>desc TAMPOV</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TAMP</name>
              <description>desc TAMP</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>AWTIMER</name>
              <description>desc AWTIMER</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ALARMB</name>
              <description>desc ALARMB</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ALARMA</name>
              <description>desc ALARMA</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>desc ICR</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INTERVAL</name>
              <description>desc INTERVAL</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMPOV</name>
              <description>desc TAMPOV</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAMP</name>
              <description>desc TAMP</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AWTIMER</name>
              <description>desc AWTIMER</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ALARMB</name>
              <description>desc ALARMB</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ALARMA</name>
              <description>desc ALARMA</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWTARR</name>
          <description>desc AWTARR</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ARR</name>
              <description>desc ARR</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWTCNT</name>
          <description>desc AWTCNT</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CNT</name>
              <description>desc CNT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPCFR1</name>
          <description>desc COMPCFR1</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGN</name>
              <description>desc SIGN</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIOD</name>
              <description>desc PERIOD</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>desc COMP</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
