hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/7 USB充电检测仪（不含关断功能 OK ）/IDEsupport/EWARM/arm/config/debugger/WHXY/CW32L010.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VC1</name>
      <description>desc VC1</description>
      <baseAddress>0x400000A4</baseAddress>
      <interrupt>
        <name>VC1</name>
        <description>Voltage Comparator 1 Interrupt</description>
        <value>14</value>
      </interrupt>
      <groupName>VC</groupName>
      <headerStructName>VC</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR0</name>
          <description>VC Control register0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INN</name>
              <description>desc NCHANNEL</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>INP</name>
              <description>desc PCHANNEL</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WINDOW</name>
              <description>desc WINDOW</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>POL</name>
              <description>desc POL</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>desc IE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HYS</name>
              <description>desc HYS</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESP</name>
              <description>desc RESP</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>VC Control register1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BLANKLVL</name>
              <description>desc BLANKLVL</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANKTIME</name>
              <description>desc BLANKTIME</description>
              <msb>16</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANKATCH6</name>
              <description>desc BLANKATCH6</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANKATCH5</name>
              <description>desc BLANKATCH5</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANKATCH4</name>
              <description>desc BLANKATCH4</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANKATCH3</name>
              <description>desc BLANKATCH3</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANKATCH2</name>
              <description>desc BLANKATCH2</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BLANKATCH1</name>
              <description>desc BLANKATCH1</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGHIE</name>
              <description>desc HIGHIE</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEIE</name>
              <description>desc RISEIE</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLIE</name>
              <description>desc FALLIE</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLTCLK</name>
              <description>desc FLTCLK</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLTTIME</name>
              <description>desc FLTTIME</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>VC State REG</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLTV</name>
              <description>desc FLTV</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>INTF</name>
              <description>desc INTF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
