hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/7 USB充电检测仪（不含关断功能 OK ）/IDEsupport/EWARM/arm/config/debugger/WHXY/CW32L010.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="VC1">
      <name>VC2</name>
      <description>desc VC2</description>
      <baseAddress>0x400000B4</baseAddress>
      <interrupt>
        <name>VC2</name>
        <description>Voltage Comparator 2 Interrupt</description>
        <value>15</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>VCDIV</name>
      <description>desc VCDIV</description>
      <baseAddress>0x400000A0</baseAddress>
      <groupName>VC</groupName>
      <headerStructName>VCDIV</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIV</name>
          <description>VCREF Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VIN</name>
              <description>desc VIN</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV</name>
              <description>desc DIV</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>